src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/ManagerModule.bsl
Функция ПолучитьПоСотруднику(Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Пользователь
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.ФизическоеЛицо = &Сотрудник");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Неопределено, Рез.Выгрузить()[0].Пользователь);
КонецФункции

Функция СформироватьСписокРолей(ПользовательИБ) Экспорт
	СписокРолей = "";
	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(СписокРолей, Роль.Синоним, ", ");
	КонецЦикла;
	Возврат СписокРолей;	
КонецФункции
